package com.company;

/*
В переменных q и w хранятся два натуральных числа. Создайте программу, выводящую
 на экран результат деления q на w с остатком.
Пример вывода программы (для случая, когда в q хранится 21, а в w хранится 8):
21 / 8 = 2 и 5 в остатке


В переменной n хранится натуральное двузначное число. Создайте программу, вычисляющую и выводящую
на экран сумму цифр числа n...

В переменной n хранится натуральное трёхзначное число. Создайте программу, вычисляющую и
выводящую на экран сумму цифр числа n.

В переменной n хранится вещественное число с ненулевой дробной частью.
Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.

Дан фрагмент программы:
_______ s = 120;
System.out.println(s-20);
Какой тип данных нужно подставить вместо прочерка, чтобы программа работала корректно, переменная s занимала наименьший
 объём памяти, а в результате исполнения на экран вывелось натуральное число?
 */
public class Main {

    public static void main(String[] args) {
        byte s = 120;
        System.out.println(s - 20);

//        double n = 15.3;
//
//        System.out.println();

//        int n = 163;
//
//        System.out.println((n / 100) + (n / 10 % 10) + (n % 10));


//        int n = 74;
//
//        System.out.println((n / 10)+(n % 10));


//        int q = 17;
//        int w = 3;
//
//        System.out.println(q + " / " + w + " = " + q / w + " и " + q % w + " в остатке");
        /*
        Основные операторы Java

        Оператор присвоения
        int x = 2 + 3 * 5 / 7;

        Математические операторы
        +
        -
        *
        /
        %  оператор вычесления остатка от деления  9 % 2 = 1

         Операторы сравнения
         <
         <=
         >
         >=
         ==
         !=  не равно

         Логические операторы
         &&  И      true && true && false
         ||  ИЛИ    true || true || false
         !   НЕ
         */

//        int x;
//        int y = 3;
//        x = y * 2;
//        int a = 1, b, c = 2, z;
//
//
//        byte bt = 5; // -128 to +127      00000100
//        short st = 5; // -32768 to +32767
//        int it = 5; // -2147483648 to +2147483647
//        long lg = 5; // -9223372036854775808 to +...
//
//        float ft = 5.3f;
//        double db = 5.3;
//
//        char cr = 'a';
//
//        boolean bl = true;


        // write your code here
        /*

         */

        /**
         *
         *
         *
         */
    }
}
